import 'dart:async';
import 'package:abdullah_asad/Helper/util.dart';
import 'package:flutter/material.dart';
import 'package:abdullah_asad/utilities/layout_helper.dart';
import 'package:easy_localization/easy_localization.dart';
class AbdoutShikh extends StatefulWidget {
  @override
  _AbdoutShikhState createState() => _AbdoutShikhState();

  List<Map<String,dynamic>> aboutContent = [];
}

class _AbdoutShikhState extends State<AbdoutShikh> {
  @override
  void initState() {
    super.initState();
  }

  List<Map<String,dynamic>> aboutContent = [
    {'title': 'هو الشيخ العلامة المحدث عبد الل ',
     'description': 'هو الشيخ العلامة المحدث عبد الله بن عبد الرحمن بن محمد آل سعد المطيري. \n\n'
        'ولد في مدينة الزبير عام 1381هــ، ثم استقر به المقام في مدينة الرياض، ودرس فيها المرحلة الثانوية، والتحق بقسم العلوم الطبيعية، ثم حبب إليه دراسة العلوم الشرعية، فانتقل في السنة الثالثة إلى المعهد العلمي، وبعد أن أنهى الدراسة الثانوية التحق بجامعة الإمام كلية أصول الدين «قسم السنة» وتخرج فيها.',
    },
    {'title': 'شيوخه',
      'description': 'أخذ الشيخ عن كثير من علماء عصره وقرأ عليهم، منهم:\n\n'
        '\n O - الشيخ عبد العزيز بن عبد الله بن باز رحمة الله، وقد حضر دروس الشيخ التي كانت في الجامع الكبير، وكان الشيخ في ذلك الوقت في نهاية السنة الثانية من المرحلة الثانوية.'
        '\n O - الشيخ عبد الله بن حميد رحمة الله عليه، فقد حضر دروسه قُبيل وفاته بنحو سنة ونصف تقريبًا.'
        '\n O - الشيخ محمد بن صالح العثيمين رحمة الله، فقد كان الشيخ يتردد عليه في عُنيزة في الإجازة الطويلة.'
        '\n O - الشيخ عبد الله بن عبد الرحمن الجبرين، فقد حضر الشيخ في مجالسه، وقرأ عليه يسيرًا.'
        '\n O - الشيخ فهد بن حُميّن الفهد رحمة الله، وقد كانت دروس الشيخ فهد في منزله في البطحاء.'
        '\n O - الشيخ عبد الله الدويش رحمة الله، وكان الشيخ الدويش من كبار علماء الحديث في وقته، وقد قرأ الشيخ عليه يسيرًا إبّان إقامته في عنيزة من كتاب «الجامع» لأبي عيسى الترمذي.'
        '\n O - الشيخ عبد الرحمن بن ناصر البراك حفظه الله ورعاه، حضر دروسه فترة يسيرة، وقد كانت في التوحيد، والنحو.'
        '\n O -  الشيخ عبد الله بن عبد العزيز العقيل رحمة الله عليه، وهو من كبار علماء الحنابلة في وقته.'
        '\n O -  الشيخ عبد الله بن عبد الرحمن الغديان رحمة الله عليه، وهو من كبار علماء الأصول في وقته.''الشيخ عبد الله بن عبد الرحمن البسام رحمه الله تعالى، درس عليه يسيرًا في الفقه في كتاب'
        '\n «شرح الزركشي على مختصر الخرقي».'
    },
    {'title': 'الدروس العلمية',
      'description': 'وللشيخ دروس كثيرة منها ما هو شروح لمتون علمية أو تعليقات على بعض الكتب، أو تأصيل لمسألة علمية. \n\n'

          '\n * ومن الكتب التي شرحها الشيخ وعلق عليها في دروسه:'
          '\n'
          '\n 1. كتاب السنة لعبد الله بن أحمد.'
          '\n 2. كتاب التوحيد لابن خزيمة.'
          '\n 3. العقيدة الواسطية لابن تيمية.'
          '\n 4. درجات الصاعدين إلى مقامات الموحدين.'
          '\n 5. صحيح البخاري، وصحيح مسلم.'
          '\n 6. السنن الأربعة (أبو داود، الترمذي، النسائي، ابن ماجه).'
          '\n 7. السنن الكبرى للنسائي.'
          '\n 8. الموطأ للإمام مالك.'
          '\n 9. صحيح ابن خزيمة.'
          '\n 10. الإحسان في تقريب صحيح ابن حبان.'
          '\n 11. المنتقى لابن الجارود.'
          '\n '
          '\n وغيرها كثير من الكتب.'
    },
    {'title': 'مؤلفاته المطبوعة',
      'description': 'للشيخ حفظه الله مؤلفات عديدة في علوم الحديث وغيره، منها: \n\n'
          '\n 1. كيف تكون محدثًا إصدار دار الإداوة.'
          '\n 2. البرهان في وجوب اللجوء إلى الواحد الديان إصدار دار المحدث.'
          '\n 3. فتح الواحد العلي في الدفاع عن صحابة النبي إصدار دار المحدث.'
          '\n 4. الحوثيون وبيان خطرهم على الأمة.'
          '\n 5. الإعلام في بيان خطر الزحف المجوسي على بلاد الإسلام إصدار دار الإداوة.'
          '\n 6. معرفة مراتب الثقات دار الحضارة.'
          '\n 7. مُقدّمة (الأربعون الثُّلاثية) إصدار دار المحدث.'
          '\n 8. اتباع الصراط في الرد على دعاة الاختلاط إصدار دار المحدث.'
          '\n 9. التيسير بين المشروع والممنوع إصدار دار المحدث.'
          '\n 10. أم سليم دروس وعبر إصدار دار الإداوة.'
          '\n '
          '\n وهذا فضلا عن الكتب التي قدم لها الشيخ حفظه الله بمقدمات وتعليقات لمؤلفين من مشايخ وطلبة العلم جاوزت ثمانين مقدمة.'
    },
    {'title': 'تلاميذ الشيخ',
      'description': 'وقد تتلمذ على يديه كثيرون يصعب حصرهم في أكثر من بلد، ومنهم:\n\n'
          '\n 1. إبراهيم بن عمر السكران'
          '\n 2. د. بندر بن عبد الله الشويقي.'
          '\n 3. تركي بن عبد العزيز العقيل.'
          '\n 4. د. صالح بن عبد الله العصيمي.'
          '\n 5. صالح بن علي اللحيدان.'
          '\n 6. عبدالرحمن عمر الفقيه.'
          '\n 7. عبدالعزيز بن مرزوق الطريفي.'
          '\n 8. د. عبدالمحسن بن محمد القاسم (إمام وخطيب المسجد النبوي).'
          '\n 9. ماهر ياسين الفحل.'
          '\n '
          '\n وعدد كثير غيرهم، نسأل الله عز وجل أن يوفقهم جميعهم لما يحبه ويرضاه.'
    },
    {'title': 'قالوا عنه',
      'description': ''
          '\n O - ويقول الشيخ عبدالله العقيل عنه: (الشيخ عبدالله علامة محدث).'
          '\n O -  وقال الشيخ عبدالله الجبرين: (نعرف الشيخ عبدالله أنه من المذكورين بالعلم والحفظ والإتقان وقوة الذاكرة وسرعة الاستحضار وكثرة المحفوظات وتنوع العلوم في الحديث والتوحيد والعقائد والتفسير ونحوها، وما نعرف عنه من البعد عن التسرع والأغلاط، والخوض فيما لا يعني).'
          '\n '
    },
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: app_bar(context, 'about_shikh'.tr()),
        body:Scaffold(
            body: Stack (
                children: <Widget>[
                  appBgImage(),
                  Container(
                    padding: EdgeInsets.only(top: 20),
                    child: ListView.builder(
                        itemCount: aboutContent.length,
                        itemBuilder: (BuildContext ctx, int index) {
                          return _fatawaView(index);
                        }),
                  ),
                ]
            )
        )
    );
  }


  Widget _fatawaView(index) {
    final currentQuestion = aboutContent[index];
    return ExpansionTile(
      key: Key(currentQuestion['title'] + TimeOfDay.now().toString()),
      title: Container(
        padding: EdgeInsets.all(10),
        decoration: simpleDecorationStyle,
        child: Text(currentQuestion['title'],
            maxLines: 1,
            // textDirection: TextDirection.rtl,
            style: arabicTxtStyle(paramBold: true),
            overflow: TextOverflow.ellipsis),
      ),
      children: <Widget>[
        Row(
          children: <Widget>[
            Expanded(
              child: Container(
                  padding: EdgeInsets.all(5),
                  child: Container(
                    padding: EdgeInsets.all(10),
                    decoration: simpleDecorationStyle,
                    child: Text(currentQuestion['description'],
                        // textDirection: TextDirection.rtl,
                        style: arabicTxtStyle(paramSize: 20)),
                  )),
            ),
          ],
        ),
        SizedBox(height: 15),
      ],
    );
  }

}
